eisup_2019_docmng_integration/src/InformationRegisters/абс_ИсторияСтатусовКадровоРасчетныхДокументов/абс_ИсторияСтатусовКадровоРасчетныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ИсторияСтатусовКадровоРасчетныхДокументов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыКадровоРасчетныхДокументов</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ОплатаПраздничныхИВыходныхДнейОрганизаций</types>
      <types>DocumentRef.ПремииРаботниковОрганизаций</types>
      <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
      <types>DocumentRef.Абс_АктПриёмкиВыполненныхРабот</types>
      <types>DocumentRef.ОтпускПоУходуЗаРебенком</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ИсторияСтатусовКадровоРасчетныхДокументов/ManagerModule.bsl
// Вернуть статус документа на дату и время
//
// Параметры
//  ДокументСсылка  - ДокументСсылка.ОтчетКомиссионераОПродажах и т.др. - Документ статуса
//  ПериодСтатуса - ДатаВремя - Необязательный по ум. текущее время. Дата и время статуса 
//
// Возвращаемое значение:
//   ПеречислениеСсылка.абс_СтатусыКадровоРасчетныхДокументов   - Искомый статус
//
// {{KM WARE Трухан А.Г. ЧТЗ Агентский НДС 11.09.2015 начало
Функция ВернутьСтатусДокумента(Знач ДокументСсылка, ПериодСтатуса=Неопределено) Экспорт
	Отборы_стру = Новый Структура("Документ",ДокументСсылка); 
	ДатаСтатуса = ?(ТипЗнч(ПериодСтатуса)<>Тип("Дата"),ТекущаяДата(),ПериодСтатуса);
	Ресурсы_стру = РегистрыСведений.абс_ИсторияСтатусовКадровоРасчетныхДокументов.ПолучитьПоследнее(ДатаСтатуса,Отборы_стру);
	Возврат Ресурсы_стру.Статус;
КонецФункции // () }}KM WARE Трухан А.Г.  ЧТЗ Агентский НДС 11.09.2015 окончание

// Установить статус документу на дату и время
//
// Параметры
//  ДокументСсылка  - ДокументСсылка.ОтчетКомиссионераОПродажах и т.др. - Документ статуса
//  Статус 		- ПеречислениеСсылка.абс_СтатусыКадровоРасчетныхДокументов   - Требуемый статус 
//  ПериодСтатуса 	- ДатаВремя - Необязательный по ум. текущее время. Дата и время статуса 
//  Комментарий 	- Строка(200) - Необязательный  
//
// Возвращаемое значение:
//   ПеречислениеСсылка.абс_СтатусыКадровоРасчетныхДокументов   - Требуемый статус
// {{KM WARE Трухан А.Г. ЧТЗ Агентский НДС 11.09.2015 начало
Функция УстановитьСтатус(Знач ДокументСсылка, Знач Статус, Знач ПериодСтатуса=Неопределено, Комментарий) Экспорт
	//Отборы_стру = Новый Структура("ДокументСсылка",ДокументСсылка); 
	ДатаСтатуса = ?(ТипЗнч(ПериодСтатуса)<>Тип("Дата"),ТекущаяДата(),ПериодСтатуса);
    Набор = РегистрыСведений.абс_ИсторияСтатусовКадровоРасчетныхДокументов.СоздатьНаборЗаписей();
	Набор.Отбор.Документ.Установить(ДокументСсылка);
	Набор.Отбор.Период.Установить(ДатаСтатуса);
    Набор.Прочитать();
	Если Набор.Количество() = 0 Тогда
	    ЗаписьНабора = Набор.Добавить();
	ИначеЕсли Набор.Количество() = 1 Тогда
	    ЗаписьНабора = Набор[0];
	КонецЕсли;	
	
	ЗаписьНабора.Документ = ДокументСсылка;
    ЗаписьНабора.Период = ДатаСтатуса;
    ЗаписьНабора.Статус = Статус;
    ЗаписьНабора.Пользователь = ПараметрыСеанса.ТекущийПользователь;
    ЗаписьНабора.Комментарий = сокрЛП(Комментарий);
	Попытка
	    Набор.Записать(Истина);
		Возврат ЗаписьНабора.Статус;
	Исключение
		Комментарий = ОписаниеОшибки();
		Возврат Неопределено;
	КонецПопытки;  
		
КонецФункции // () }}KM WARE Трухан А.Г. ЧТЗ Агентский НДС 11.09.2015 окончание
